// 1) შექმენით posts.json რომელშიც ჩაწერთ https://jsonplaceholder.typicode.com/posts ამ ეიპიაიდან წამოღებულ ინფოს, შემდეგ შექმენით ფუნცქია რომელიც წაიკითხავს ამ პოსტებს და წაშლის ყველა იმ პოსტს რომლის სათაურიც მეტია 30 სიმბოლოზე. ამ ფუნცქიის გაშვების მერე posts.json ში უნდა დარჩეს მხოლოდ ისეთი პოსტები რომლის სათაურებიც 30-ზე ნაკლებია.



// 2) შექმენით ფუნცქია რომელიც შეასრულებს შემდეგ დავალებას, როდესაც გაუშვებთ node main.js CREATE john@gmail.com john 21  შექმნის users.json ში ახალ იუზერს ყოველ გამოძახებაზე უნდა დაემატოს ახალი იუზერები users.json ში, მაგრამ როდესაც გამოიძახებ node main.js DELETE john@gmail.com ასეთ დროს უნდა წაიშალოს ეს იუზერი users.json დან, გაითვალისწინეთ რომ მეილი უნიკალურია ამიტომ დაწერეთ შემოწმება თუ ეგეთი მეილით უკვე ჩაწერილია იუზერი მაშინ აღარ ჩაწეროთ.

// 3) შექმენით ახალი ფაილი products.json სადაც ჩაწერთ პროდუექტების სიას თითოეულ პროდუქტს უნდა ქონდეს, სახელი, აღწერა, ფასი, ფერი. როდესაც გაუშვებთ შემდეგ ბრძანებას node main.js ASC უნდა დაილოგოს პროდუქტები რომლებიც დალაგებული იქნება ფასის მიხედვით ზრდადობით ხოლო თუ გამოიძახა ბრძანება node main.js DESC უდნა დაილოოს პროდუქტები რომლებიც იქნება დალაგებული ფასის მიხედვით კლებადობით.